_protected/frontend/controllers/OtherController.php

SELECT * FROM `bolimlar` WHERE `id`='3'
SELECT * FROM `xodimlar` WHERE `bolim_id`='3'
---
    public function actionAbout($id){ // product list
        $model = Bolimlar::findOne(['id' => $id]);
        $xodimlar = Xodimlar::find()->where(['bolim_id' => $id])->all();

SELECT * FROM `yangilik` WHERE `id`='5'
SELECT * FROM `yangilik` WHERE id != '5' ORDER BY `id` DESC LIMIT 3
---
    public function actionYangilikBatafsil($id){
        $model = Yangilik::findOne(['id' => $id]);
        $yangiliklar = Yangilik::find()->where('id != :id', ['id'=>$id])->orderBy(['id' => SORT_DESC])->limit(3)->all();