_protected/backend/views/layouts/left_side.php

use yii\helpers\Url;
use common\models\Kurslar;

$courses = Kurslar::find()->all();
---
SELECT * FROM `kurslar`