_protected/frontend/views/site/index.php

SELECT * FROM `kurslar`
---
use yii\helpers\Url;
use common\models\Teachers;

$courses = Kurslar::find()->all();