_protected/common/models/Lang.php

SELECT * FROM `lang` WHERE `default` = 1
---
    static function getDefaultLang()
    {
        return Lang::find()->where('`default` = :default', [':default' => 1])->one();

SELECT * FROM `lang` WHERE url = ''
---
    static function getLangByUrl($url = null)
    {
        if ($url === null) {
            return null;
        } else {
            $language = Lang::find()->where('url = :url', [':url' => $url])->one();